[Killed] Throw_
e2e/Force_Error/src/SourceClass.php:16:13
     public static function create(int $foo): self
     {
         if ($foo < 0) {
-            throw new \InvalidArgumentException('Error');
+            new \InvalidArgumentException('Error');
         }
 
killedBy: Force_Error\Test\SourceClassTest::test_fail
statusReason: 1) Force_Error\Test\SourceClassTest::test_fail
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
e2e/Force_Error/src/SourceClass.php:22:5
         return new self($foo);
     }
 
-    public function value(): int
+    protected function value(): int
     {
         return $this->foo;
statusReason: 1) Force_Error\Test\SourceClassTest::test_hello with data set "Example" (0, Force_Error\SourceClass Object (...))
Error: Call to protected method Force_Error\SourceClass::value() from scope Force_Error\Test\SourceClassTest

/opt/infection/tests/e2e/Force_Error/tests/SourceClassTest.php:21

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.
